InformationRegisters/СервисСверкиРасчетовУстаревшиеIDУчастниковСверки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СервисСверкиРасчетовУстаревшиеIDУчастниковСверки</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УчастникСверки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СервисСверкиРасчетовУстаревшиеIDУчастниковСверки/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОчиститьРегистрПоУчастникамСверки(УчастникиСверки) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СервисСверкиРасчетовУстаревшиеIDУчастниковСверки.УчастникСверки КАК УчастникСверки,
	|	СервисСверкиРасчетовУстаревшиеIDУчастниковСверки.Идентификатор КАК Идентификатор
	|ИЗ
	|	РегистрСведений.СервисСверкиРасчетовУстаревшиеIDУчастниковСверки КАК СервисСверкиРасчетовУстаревшиеIDУчастниковСверки
	|ГДЕ
	|	СервисСверкиРасчетовУстаревшиеIDУчастниковСверки.УчастникСверки В (&УчастникиСверки)";
	
	Запрос.УстановитьПараметр("УчастникиСверки", УчастникиСверки);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	Выборка = Результат.Выбрать();
	
	// Набор записей текущего регистра.
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.РасширенныеРежимыЗамещения = Истина;
	
	Пока Выборка.Следующий() Цикл
		Запись = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Выборка);
		СервисСверкиРасчетов.ПриАктуализацииIDУчастникаСверки(Выборка.УчастникСверки);
	КонецЦикла;
	
	НаборЗаписей.Записать(РежимЗамещения.Удаление);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
